{"title": {"az": "Taksi", "en": "Taxi", "ru": "Такси"}, "statement": {"az": "\"Pik\" saatında eyni marşrut üzrə hərəkət edən üç marşrut taksisi eyni vaxtda dayanacağa yaxınlaşdı və sərnişinlər dərhal onlara doluşdular. Hər marşrut taksisində sərnişinlərin sayının fərqli olduğunu görən sürücülər qərara gəldilər ki, sərnişinlərin bir hissəsinin yerini elə dəyişdirsinlər ki, hər marşrut taksisində bərabər sayda sərnişin olsun. Hansı minimum sayda sərnişini düşürdüb yenidən yerləşdirmək lazım olduğunu müəyyənləşdirmək tələb olunur.\r\n", "en": "At the rush hour, three taxi buses drove up at the same time, following one route, where the passengers immediately got crowded. The drivers found that the number of people in taxis is different, so they decided to relocate a part of passengers so that in each minibus there will be an equal number of passengers. Determine what is the fewest number of passengers have to be relocated at the same time.\r\n", "ru": "В час пик на остановку одновременно подъехали три маршрутных такси, следующие по одному маршруту, в которые тут же набились пассажиры. Водители обнаружили, что количество людей в разных маршрутках разное, и решили пересадить часть пассажиров так, чтобы в каждой маршрутке было поровну пассажиров. Требуется определить, какое наименьшее количество пассажиров придется при этом пересадить."}, "input_format": {"az": "Giriş verilənləri **100**-ü aşmayan **3** natural ədəddən ibarətdir və bu ədədlər uyğun olaraq **1**-ci, **2**-ci və **3**-cü marşrut taksisinə minmiş sərnişinlərin sayını ifadə edirlər.", "en": "Three integers not greater than **100** - the number of passengers in the first, second and third taxi bus.\r\n", "ru": "Три натуральных числа, не превосходящих **100** - количество пассажиров в первой, второй и третьей маршрутках соответственно.\r\n"}, "output_format": {"az": "Çıxışa bir ədəd - yenidən yerləşdirilməsi tələb olunan sərnişinlərin minimum sayı verilir. Bu mümkün olmadıqda böyük hərflərlə **IMPOSSIBLE** sözü çıxışa verilir.", "en": "Print one number - the minimum number of passengers that must be relocated.  If its not possible, print the word **IMPOSSIBLE** (with capital letters).", "ru": "Выведите одно число - наименьшее количество пассажиров, которое требуется пересадить. Если это невозможно, выведите слово **IMPOSSIBLE** (заглавными буквами)."}, "notes": {"az": "", "en": "", "ru": ""}, "scores_format": {"az": "", "en": "", "ru": ""}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}