{"title": {"az": "İki at", "en": "Two horses", "ru": "Два коня"}, "statement": {"az": "Siz Cıdır Düzü, Şuşa şəhərində olan bir açıq sahədə durursunuz və birdən bir-birinə doğru özgərəkən iki Qarabağ atı görürsünüz.\r\n\r\nİki atın mövqeləri, yatay xətt üzərində tam ədədlərlə ifadə edilə bilər. Sol tərəfdəki at hazırda $x$ mövqəsindədir, sağ tərəfdəki at isə hazırda $y$ mövqəsindədir $(x<y)$. Hər bir at hər saniyə başqa bir mövqəyə sıçrayır. Sol tərəfdəki at $a$ məsafəsində müsbət istiqamətdə sıçrayır, sağ tərəfdəki at isə $b$ məsafəsində mənfi istiqamətdə sıçrayır.\r\n\r\n![предварительный просмотр](https://i.ibb.co/52mJ90W/BSTD2tj-CAAAKw5o.jpg)\r\n \r\nMəsələn, $x=1$, $y=14$, $a=3$ və $b=4$ olsun. Birinci saniyədə hər iki at mövqələri $4$ və $10$ olacaqdır. İkinci saniyədə hər iki at mövqələri $7$ və $6$ olacaqdır.\r\n\r\n\r\nMaraqlı sual: İki at eyni mövqədə eyni vaxtda olacaqlar? Əgər bəli, bu neçə vaxt aparacaq? Atların eyni nöqtədə yığılacağı anın (saniyələrlə) tapılması lazımdır.\r\n\r\n####Giriş verilənləri\r\nSətir $x$, $y$, $a$, $b$ olmaq üzrə dörd tam ədəddən ibarətdir ($0 \\\\leq x \\\\le y \\\\leq 10^9$, $1 \\\\leq a,b \\\\leq 10^9$) - sol atın hazırkı və sağ atın hazırkı mövqeyi, sol atın səthi uçuş məsafəsi və sağ atın səthi uçuş məsafəsi.\r\n\r\n####Çıxış verilənləri\r\nYalnız bir tam ədəd çap edin: iki atın eyni mövqeyə gəlmək üçün neçə saniyəyə ehtiyacı olacağı. Əgər onlar heç vaxt görüşməsələr, $-1$ çap edin.\r\n\r\n####Qiymətləndirmə (Alt tapşırıqlar)\r\nBu tapşırıq aşağıdakı 2 mərhələdən ibarətdir:\r\n\r\n| Alt trapşırıq | Əlavə məhdudiyyətlər | Qiymətləndirmə |\r\n|------------------------|--------------------------------------- ------------|---------|\r\n| 1 | ($0 \\\\leq x \\\\le y \\\\leq 100$, $1 \\\\leq a,b \\\\leq 100$ | 30 bal |\r\n| 2 | Əlavə məhdudiyyət yoxdur | 70 bal |\r\n", "en": "Imagine that you are lying on the meadow of Dzhydir duzu, in the city of Shusha, Azerbaijan. And suddenly you saw two Karabakh horses hopping towards each other.\r\n\r\nThe positions of the two horses can be represented as integer coordinates on a horizontal line. The left horse is currently in position $x$, and the right horse is currently in position $y$ $(x<y)$. Every second, each horse hops to another position. The left horse hops in the positive direction by $a$, and the right horse hops in the negative direction by $b$.\r\n\r\n![preview](https://i.ibb.co/52mJ90W/BSTD2tj-CAAAKw5o.jpg)\r\n\r\nFor example, let's say $x=1$, $y=14$, $a=3$, and $b=4$. In the 1st second, each horse will be at positions $4$ and $10$. At the 2nd second, each horse will be at positions $7$ and $6$.\r\n\r\nInteresting question: Will the two horses be in the same position at the same moment? If so, how long will it take? Let's find a moment in time (in seconds) after which the horses will be at the same point.\r\n\r\n\r\n\r\n####Input\r\n\r\nThe line consists of four integers $x$, $y$, $a$, $b$ ($0 \\\\leq x \\\\le y \\\\leq 10^9$, $1 \\\\leq a,b \\\\leq 10^9$) - the current position of the left horse, the current position of the right horse, the hopping distance of left horse, and the hopping distance of the right horse, respectively.\r\n\r\n#### Output\r\n\r\nPrint the single integer: the number of seconds the two horses will take to be at the same position.\r\nIf the two horses will never be in the same position simultaneously, print $-1$.\r\n\r\n\r\n#### Grading (Subtasks)\r\n\r\nThis task consists of the following 2 subtasks:\r\n\r\n| Subtask | Additional restrictions                           | Grading |\r\n|---------|---------------------------------------------------|---------|\r\n| 1       | ($0 \\\\leq x \\\\le y \\\\leq 100$, $1 \\\\leq a,b \\\\leq 100$ | 30 points  |\r\n| 2       | No additional restrictions                        | 70 points  |", "ru": "Представьте, что вы лежите на поляне Джыдыр дюзю, в городе Шуша, Азербайджан. И вдруг вы увидели двух карабахских лошадей, скачущих навстречу друг другу.\r\n\r\nПоложения двух лошадей можно представить в виде целочисленных координат на горизонтальной линии. Левая лошадь в настоящее время находится в позиции $x$, а правая лошадь в настоящее время находится в позиции $y$ $(x<y)$. Каждую секунду каждая лошадь прыгает на другую позицию. Левая лошадь прыгает в положительном направлении на $a$ позиций, а правая лошадь прыгает в отрицательном направлении на $b$ позиций.\r\n\r\n![предварительный просмотр](https://i.ibb.co/52mJ90W/BSTD2tj-CAAAKw5o.jpg)\r\n\r\nНапример, пусть $x=1$, $y=14$, $a=3$ и $b=4$. В 1-ю секунду каждая лошадь будет на позициях $4$ и $10$. На 2-й секунде каждая лошадь будет на позициях $7$ и $6$.\r\n\r\nИнтересный вопрос: будут ли две лошади находиться в одном и том же положении в один и тот же момент? Если да, то сколько времени это займет? Найдем момент времени (в секундах), после которого лошади окажутся в одной и той же точке.\r\n\r\n\r\n\r\n####Вход\r\n\r\nСтрока состоит из четырех целых чисел $x$, $y$, $a$, $b$ ($0 \\\\leq x \\\\le y \\\\leq 10^9$, $1 \\\\leq a,b \\\\leq 10^9$) - текущее положение левой лошади, текущее положение правой лошади, расстояние прыжка левой лошади и расстояние прыжка правой лошади соответственно.\r\n\r\n#### Выход\r\n\r\nВыведите единственное целое число: количество секунд, которое потребуется двум лошадям, чтобы оказаться в одной и той же позиции.\r\nЕсли же они никогда не встретятся, выведите $-1$.\r\n\r\n\r\n#### Оценка (подзадачи)\r\n\r\nЭта задача состоит из следующих 2-х пунктов:\r\n\r\n| Пункт | Дополнительные ограничения | Оценка |\r\n|------------------------|--------------------------------------- ------------|---------|\r\n| 1 | ($0 \\\\leq x \\\\le y \\\\leq 100$, $1 \\\\leq a,b \\\\leq 100$ | 30 баллов |\r\n| 2 | Без дополнительных ограничений | 70 баллов |"}, "input_format": {"az": "", "en": "", "ru": ""}, "output_format": {"az": "", "en": "", "ru": ""}, "notes": {"az": "", "en": "", "ru": ""}, "scores_format": {"az": "", "en": "", "ru": ""}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}