{"title": {"az": "AzCoders platformanın kodu", "en": "Code of AzCoders platform", "ru": "Код платформы AzCoders"}, "statement": {"az": "AzCoders platformasının proqramçıları veb-sayt üzərində işlədilər. Saytın HTML kodunu yazdılar, lakin təsadüfən başqa bir proqramçı səhv etdi və kodda **\"&$amp$;\"** simvolunu çox əlavə etdi və kodu yaddaşda saxladı. HTML kodu veb-saytın strukturunu göstərən bir mətndir. AzCoders proqramçıları işdən çıxarılmazdan öncə kodu təcili olaraq düzəltməlidirlər. Sizin tapşırığınız HTML kodunda olan bütün **\"&$amp;$\"** simvollarını silməkdir. Sözlərin ardıcıllığı ilk koddakı kimi eyni olmalıdır və sözlər arasındakı boşluqların sayı $1$ olmalıdır. \r\n\r\nMəsələn, əgər kod \"&$amp;$ hi AzCoders! &$amp;$\" şəklindədirsə, siz bu kodu \"hi AzCoders!\" şəklində düzəltməlisiniz. Yeni koddakı sözlər \"hi\" və \"AzCoders!\" olacaq. Gördüyünüz kimi, sözlərin ardıcıllığı eynidir və sözlərin arasındakı boşluqların sayı $1$ olacaq.\r\n\r\n\r\n#### Giriş verilənləri\r\nİlk sətirdə $n$ tam ədədi verilir ($1 \\\\leq n \\\\leq 10^5$) - kodun simvollarının sayı.\r\nNövbəti sətirdə $n$ sayda simvoldan ibarət kod verilir.\r\n\r\n#### Çıxış verilənləri\r\nYeganə sətirdə təzə kodu çıxışa verin. Sözlərin ardıcıllığı ilk koddakı kimi eyni olmalıdır və sözlər arasındakı boşluqların sayı $1$ olmalıdır. \r\n\r\n#### Qiymətləndirmə (Alt tapşırıqlar)\r\n\r\nBu məsələ aşağıdakı kimi 1 alt tapşırıqdan ibarətdir:\r\n\r\n| Alt tapşırıq | Məhdudiyyət                           | Qiymətləndirmə |\r\n|--------------|---------------------------------------|----------------|\r\n| 1            | əlavə məhdudiyyət yoxdur              |     100 bal    |\r\n\r\n", "en": "The programmers of the AzCoders platform worked on the web development of the website. They wrote the HTML code for the website, but by chance, another programmer made a mistake and added the string **\"&$amp;$\"** in the code, a lot of times and saved the code. HTML code is the text that contains the structure of the website. Programmers of AzCoders urgently need to fix the code before they are fired. Your task is to remove the string **\"&**$amp;$\" everywhere from the HTML code. The order of the words must be the same as in the original code and the number of spaces between two words must be always $1$. \r\nFor example, if the code is **&**\"$amp;$ hi AzCoders! &$amp;$\". You must change it to this \"hi AzCoders!\".\r\n\r\nThe words in the new code are hi, AzCoders!. As you can see the order isn't changed and between each word, the amount of space is $1$.\r\n\r\n\r\n####Input\r\nThe first line contains an integer $n$ ($1 \\\\leq n \\\\leq 10^5$), the count of the characters in the code.\r\nThe next line contains $n$ characters, the code itself.\r\n\r\n####Output\r\nYou must print one line of the new fixed code. The order of the words must be the same as in the original code and the number of spaces between two words must be always $1$. \r\n\r\n####Grading (Subtasks)\r\n\r\nThis task consists of the following 1 subtask:\r\n\r\n| Subtask | Additional restrictions                           | Grading |\r\n|---------|---------------------------------------------------|---------|\r\n| 1       | No additional restrictions                        | 100 points  |\r\n\r\n", "ru": "Над разработкой веб-сайта работали программисты платформы AzCoders. Они написали HTML-код для сайта, но один из программисов случайно ошибся и много раз добавил в код строку **\"&$amp;$\"** и сохранил код. HTML-код — это текст, содержащий структуру сайта. Программистам AzCoders срочно нужно исправить код, прежде чем их уволят. Ваша задача — удалить все строки **\"&$amp;$\"** из HTML-кода. Порядок слов должен быть таким же, как и в исходном коде, а количество пробелов между двумя словами всегда должно быть $1$.\r\nНапример, если код \"&$amp;$ hi AzCoders! &$amp;$\". Вы должны изменить его на это \"hi AzCoders!\".\r\n\r\nСлова в новом коде: hi, AzCoders! . Как видите, порядок не меняется, и между каждым словом количество пробелов составляет $1$.\r\n\r\n\r\n####Вход\r\nПервая строка содержит целое число $n$ ($1 \\\\leq n \\\\leq 10^5$) — количество символов в коде.\r\nСледующая строка содержит $n$ символов, сам код.\r\n\r\n####Выход\r\nВы должны напечатать одну строку нового исправленного кода. Порядок слов должен быть таким же, как в исходном коде, а количество пробелов между двумя словами всегда должно быть $1$.\r\n\r\n####Оценка (пункты)\r\n\r\nЭта задача состоит из следующего пункта:\r\n\r\n| Пункт | Дополнительные ограничения | Оценка |\r\n|------------------------|--------------------------------------- ------------|---------|\r\n| 1 | Без дополнительных ограничений | 100 баллов |"}, "input_format": {"az": "", "en": "", "ru": ""}, "output_format": {"az": "", "en": "", "ru": ""}, "notes": {"az": "", "en": "", "ru": ""}, "scores_format": {"az": "", "en": "", "ru": ""}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}