{"title": {"az": "Stepanın dostları", "en": "Stepan Friends", "ru": "Друзья Степана"}, "statement": {"az": "Stepan məktəblilərin beynəlxalq proqramlaşdırma olimpiadasından (IOI) qayitdı və suvenir kimi `n` müxtəlif rəngli daş gətirdi. Stepan xəsis oğlan deyil, buna görə də daşları dostları ilə bölüşmək qərarına gəldi. Hər bir dostuna bir ədəd daş verdi. Beləliklə, Stepanın özündə də bir ədəd daş qaldı. Onun dostlarının sayını təyin edin.\r\n", "en": "Stepan returned from International Olympiad in Informatics (IOI) and brought with him **n** colored stones as souvenirs. Stepan is not a greedy boy, so he decided to share stones with his friends. Stepan gave to each friend exactly one stone. It turned out that Stepan has now also only one stone. Determine how many friends has Stepan.\r\n", "ru": "Степан вернулся с международной олимпиады школьников по программированию (ИОИ) и привез с собой **n** разноцветных камней в качестве сувениров. Степан вовсе не жадный мальчик, поэтому решил поделиться камнями со своими друзьями. Каждому другу Степан отдал ровно один камень. Оказалось, что у самого Степана остался тоже только один камень. Определите, сколько же у него друзей."}, "input_format": {"az": "Yeganə tam n (`1 ≤ n ≤ 100`) ədədi.", "en": "One number **n** (**1** ≤ **n** ≤ **100**).", "ru": "Одно число **n** (**1** ≤ **n** ≤ **100**)."}, "output_format": {"az": "Yeganə ədədi - Stepanın dostlarınn sayını verin.", "en": "Print the number of Stepan's friends.", "ru": "Выведите одно число - количество друзей Степана."}, "notes": {"az": "Nümünənin izahatı:\r\nStepan 2 daş gətirdi, biri özündə qaldı. Deməli ikinci daşı yekanə dostuna verdi.", "en": "Stepan brought **2** stones, one of which he left for himself. So the second stone he gave to his one friend.", "ru": "Пояснение к первому примеру:\r\nСтепан привёз **2** камня, один из которых остался у него. Значит, второй камень Степан отдал своему единственному другу."}, "scores_format": {"az": "", "en": "", "ru": ""}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}