{"title": {"az": "Qonşuların Cəmi", "en": "Sum of Neighbours", "ru": "Сумма соседей"}, "statement": {"az": "$n \\\\times n$ ölçülü kvadrat ərazidə xanalar hər bir sətirdə soldan sağa doğru olmaqla, ən üst sətirdən ən alt sətrə doğru $0$-dan $(n^2-1)$-ə ardıcıl ədədlərlə nömrələnib. \r\n\r\nNəsir bu ərazidə $k$ nömrəli xanada dayanıb və ona qonşu olan bütün xanaların nömrələri cəmini tapmaq istəyir. Bu işdə Nəsirə kömək edin.\r\n\r\nQeyd edək ki, hər bir xananın ondan birbaşa yuxarıda, aşağıda, solda və sağda olmaqla ən çox $4$ qonşusu ola bilər.\r\n\r\nAşağıda $n=4$ və $k=11$ olan nümunə təsvir edilib.\r\n\r\n![j1.png](https://i.ibb.co/VCdvd55/J1-pic.png)\r\n\r\nBurada Nəsir $11$ nömrəli xanada dayanıb və ona qonşu olan xanalar dairə ilə işarələnib. Bu halda sağ qonşu yoxdur.", "en": "In a square region of size $n \\\\times n$, cells are numbered sequentially from $0$ to $(n^2-1)$ from the top row to the bottom, left to right in each row.\r\n\r\nNasir is standing in the cell with number $k$ in this region and wants to find the sum of the numbers of all adjacent cells. Help Nasir with this task.\r\n\r\nNote that each cell can have at most $4$ neighbors directly above, below, to the left, and to the right.\r\n\r\nBelow is an example with $n=4$ and $k=11$.\r\n\r\n![j1.png](https://i.ibb.co/VCdvd55/J1-pic.png)\r\n\r\nHere Nasir is standing on the cell with number $11$, and adjacent cells are marked with circles. In this case, there is no neighbor to the right.", "ru": "В квадратной области размером $n \\\\times n$, ячейки нумеруются последовательно от $0$ до $(n^2-1)$ от верхнего ряда к нижнему, слева направо в каждой строке.\r\n\r\nНясир стоит в ячейке с номером $k$ в этой области и хочет найти сумму номеров всех соседних ячеек. Помогите Нясиру в этом задании.\r\n\r\nОбратите внимание, что каждая ячейка может иметь не более $4$ соседей непосредственно сверху, снизу, слева и справа.\r\n\r\nНиже описан пример с $n=4$ и $k=11$.\r\n\r\n![j1.png](https://i.ibb.co/VCdvd55/J1-pic.png)\r\n\r\nЗдесь Нясир стоит на ячейке с номером $11$, а соседние ячейки отмечены кружком. В данном случае соседа справа нет."}, "input_format": {"az": "Yeganə sətirdə bir boşluqla ayrılmış iki tam ədəd $n$ və $k$ ($1 <= n <= 10^6$, $0 <= k < n^2$) verilir.", "en": "In the single line, two integers $n$ and $k$ are given ($1 \\\\leq n \\\\leq 10^6$, $0 \\\\leq k < n^2$), separated by a space.", "ru": "В единственной строке даны два целых числа $n$ и $k$ ($1 <= n <= 10^6$, $0 <= k < n^2$), разделенные пробелом.\r\n"}, "output_format": {"az": "Çıxışa verilmiş xanaya qonşu xanaların nömrələri cəmini verin. ", "en": "Output the sum of the numbers of all adjacent cells to the given cell.", "ru": "Выведите сумму номеров всех соседних ячеек данной ячейки. "}, "notes": {"az": "Ilk nümunə yuxarıda təsvir edilmişdir.", "en": "The first example is explained above.", "ru": "Первый пример объяснен выше."}, "scores_format": {"az": "Bu məsələdə hər testə görə eyni bal verilir.\r\nNümunə testlər sistem teslərinə daxil deyil.", "en": "In this task, points are awarded for each correct test. Examples are not included in the system tests.", "ru": "B этом задании баллы даются за каждый правильный тест. Примеры не входят в системные тесты."}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}