{"title": {"az": "İtmiş Qələm", "en": "Lost pencil", "ru": "Потерянный карандаш"}, "statement": {"az": "## **Yaddaş limitinə diqqət!**\r\n\r\nDayının qələm kolleksiyasında hər biri fərqli rəngdə olan $n$ sayda qələm var. Bu qələmlərin rəngləri $1$-dən $n$-ə tam ədədlərlə ifadə olunur. Oyuncaqları ilə oynamaqdan bezən Müjgan bu qələmlərlə oynamaq qərarına gəldi. Bir qədər oynadıqdan sonra qələmlərdən birini itirdi, lakin dayısı xəbər tutmasın deyə öz qələmlərindən birini kolleksiyaya qoydu. Onun qoyduğu qələm də bu kolleksiyadakı qələmlərdən, itmiş qələm və ya digər biri ilə eyni rəngdədir. Əgər bu qələm itmiş qələmlə eyni rəngdə olarsa dayısı qələmin itdiyindən xəbər tutmayacaq, əks halda bu dayının gözündən qaça bilməz. Bəs siz itmiş qələmi tapa bilərsinizmi?\r\n\r\nSizə dayının kolleksiyasındakı qələmlərin sayı və Müjgan itmiş qələmi ört-basdır etdikdən sonrakı vəziyyəti, yəni oradakı qələmlərin rəngləri verilir. Müjganın itirdiyi qələmin rəngini tapın. Əgər bunu dəqiq tapmaq mümkün deyilsə çıxışa $-1$ verin. ", "en": "## **Attention to Memory Limitation!**\r\n\r\nUncle's collection contains $n$ pencils, each of which has a different color. The colors of these pencils are represented by integers from $1$ to $n$. Tired of playing with her toys, Mujgan decided to play with these pencils. After playing for some time, she lost one of the pencils, but to prevent her uncle from noticing, she replaced it with one of her own pencils. The pencil she put in is either the same color as the lost pencil or another pencil from this collection. If it's the same color as the lost pencil, her uncle won't notice that the pencil is missing, otherwise, he won't be able to miss the loss. But can you find the lost pencil?\r\n\r\nYou are given the number of pencils in Uncle's collection and the state of the pencils after Mujgan added a pencil to replace the missing one, i.e., the colors of the pencils in the collection. Find the color of the pencil Mujgan lost. If it is impossible to determine exactly, output $-1$.", "ru": "## **Внимание на ограничение по памяти!**\r\n\r\nВ коллекции дяди есть $n$ карандашей, каждый из которых разного цвета. Цвета этих карандашей выражаются целыми числами от $1$ до $n$. Устав играть со своими игрушками, Мюжган решила поиграть этими карандашами. Поиграв некоторое время, она потеряла один из карандашей, но, чтобы дядя не узнал, положила в коллекцию один из своих карандашей. Карандаш, которую она положила, того же цвета, что и потерянный карандаш или другой карандаш из этой коллекции. Если это карандаш того же цвета, что и потерянный карандаш, её дядя не узнает, что карандаш пропал, иначе он не сможет не заметить пропажу. Но сможете ли вы найти потерянный карндаш?\r\n\r\n\r\nВам дано количество карандашей в коллекции дяди и состояние карандашей после того, как Мюжган Мюжган добавила карандаш взамен пропавшей, то есть цвета карандашей из коллекции. Найдите цвет карандаша, которую потеряла Мюжган. Если это невозможно найти точно, выведите результат $-1$."}, "input_format": {"az": "Birinci sətirdə bir tam ədəd $n$($2 <= n <= 2 * 10^6$) verilir. Növbəti $n$ sətrin hər birində bir tam ədəd, $c_i$, ($1 <= c_1,c_2,...,c_n <= n$) qələmlərin rəngləri verilir. ", "en": "The first line contains a single integer $n$ ($2 <= n <= 2 * 10^6$). Each of the following $n$ lines contains an integer $c_i$ ($1 <= c_1,c_2,...,c_n <= n$) — the colors of the pencils.", "ru": "В первой строке дается одно целое число $n$ ($2 <= n <= 2 * 10^6$) . Каждая из следующих $n$ строк содержит целое число $c_i$, ($1 <= c_1,c_2,...,c_n <= n$) — цвета ручек."}, "output_format": {"az": "Çıxışa əgər Müjganın itirdiyi qələmi dəqiqliklə tapmaq mümkündürsə həmin qələmin rəngini, əks halda $-1$ verin.", "en": "If it is possible to determine exactly the pencil Mujgan lost, output the color of that pencil; otherwise, output $-1$.", "ru": "Если точно возможно найти ручку, которую Мюжган потеряла, выведите в результате цвет этой ручки, в противном случае выведите $-1$."}, "notes": {"az": "#### İlk nümünənin izahatı:\r\nİtmiş qələmin rəngi $1$-dir və Müjgan onun yerinə rəngi $2$ olan qələm qoyub.\r\n\r\n#### Ikinci nümünənin izahatı:\r\nMüjgan itmiş qələmi yaxşı ört-basdır edib :).", "en": "#### Explanation of the First Example\r\nThe color of the lost pencil is $1$, and Mujgan replaced it with a pencil of color $2$.\r\n\r\n#### Explanation of the Second Example\r\nMujgan replaced the lost pencil very well :) .", "ru": "#### Пояснение первого примера\r\nЦвет потерянного карандаша равен $1$ и Мюжган вместо него положила карандаш с цветом $2$.\r\n\r\n#### Пояснение второго примера\r\nМюжган очень хорошо заменила потерянную ручку :) .\r\n"}, "scores_format": {"az": "Bu məsələ aşağıdakı kimi $3$ alt tapşırıqdan ibarətdir:\r\n\r\n| Alt tapşırıq |  Əlavə məhdudiyyətlər | Qiymətləndirmə |\r\n|-----------------|------------------------------------------|----------------|\r\n| 1               |  $n<=1000$  |   18 bal    |\r\n| 2               | $c_1<=c_2<=...<=c_n$  |   18 bal    |\r\n| 3               | Əlavə məhdudiyyət yoxdur  |   64 bal   |", "en": "This problem consists of the following $3$ subtasks:\r\n\r\n| Subtask | Additional Constraints | Score |\r\n|---------|------------------------|-------|\r\n| 1       |  $n<=1000$             | 18 points |\r\n| 2       | $c_1<=c_2<=...<=c_n$   | 18 points |\r\n| 3       | No additional constraints | 64 points |", "ru": "Данная задача состоит из нижеследующих $3$-х подзадач:\r\n\r\n| Подзадача |  Дополнительные ограничения | Оценивание |\r\n|-----------------|------------------------------------------|----------------|\r\n| 1               |  $n<=1000$  |   18 баллов    |\r\n| 2               | $c_1<=c_2<=...<=c_n$  |   18 баллов    |\r\n| 3               | Дополнительных ограничений нет  |   64 баллов   |"}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}