{"title": {"az": "Rəngli şarlar", "en": "Colorful baloons", "ru": "Цветные шары"}, "statement": {"az": "İp boyunca soldan sağa qırmızı və göy rənglərdə rənglənmiş **n** sayda şar var. Bu şarlar **n** simvoldan ibarət **s** sətri ilə ifadə olunur.\r\n\r\n**s** in **i** ci simvolu **0** olarsa, soldan **i** ci şar qırmızı, **1** olarsa göy rəngdə rənglənib.\r\n\r\nSiz bu şarlardan bəzilərini yenidən rəngləyərək elə etməlisiniz ki, eyni rəngli yanaşı gələn şarlar olmasın. Bunun üçün ən az neçə şarı yenidən rəngləməlisiniz?\r\n", "en": "There are **n** red and blue balloons along the rope from left to right. These balloons are represented by a string **s** of **n** characters.\r\n\r\nIf the **i**-th character of **s** is **0**, the **i**-th balloon from the left is colored red, if it is **1**, it is colored blue.\r\n\r\nYou have to recolor some of these balloons so that there are no neighboring balloons of the same color. What is the least number of balloons to be repainted?\r\n\r\n\r\n\r\n\r\n", "ru": "Вдоль веревки слева направо расположено **n** шариков красного и синего цветов. Эти воздушные шары представлены строкой **s** из **n** символов.\r\n\r\nЕсли **i**-й символ **s** равен **0**, **i**-ый шарик слева окрашивается в красный цвет, если он равен **1**, он окрашивается в синий цвет.\r\n\r\nВы должны перекрасить некоторые из этих воздушных шаров, чтобы не было соседних воздушных шаров одного цвета. Какое наименьшее количество шаров следует перекрасить?\r\n\r\n\r\n\r\n"}, "input_format": {"az": "Yeganə sətirdə şarların rənglərini ifadə edən **s**  (**1** ≤ |**s**| ≤ $10^5$) verilir. Burada |**s**|, **s** sətrinin uzunluğunu bildirir.", "en": "One string **s** (**1** ≤ |**s**| ≤ $10^5$) representing the colors of balloons. Let |**s**| be the length of the string **s**.", "ru": "Одна строка **s** (**1** ≤ |**s**| ≤ $10^5$), представляющая цвета шаров. Через |**s**| обозначена длина строки **s**."}, "output_format": {"az": "Çıxışa tapşırığın şərtini ödəmək üçün yenidən rəngləməli olduğunuz şarların minimum sayını verin.", "en": "Print the minimum number of balloons that need to be repainted in order to satisfy the given condition.", "ru": "Выведите минимальное количество шаров, которое нужно перекрасить, чтобы выполнить условие задачи."}, "notes": {"az": "İlk nümünədə ortancıl şarı göy rəngdə rəngləməklə tapşırığın şərtini ödəmək olar.\r\n\r\nİkinci nümünədə heç bir şarı yenidən rəngləməyə ehtiyac yoxdur.", "en": "In the first test, the condition of the problem can be fulfilled by painting the middle (second) ball with blue color.\r\n\r\nIn the second test, there is no need to repaint the balloons.", "ru": "В первом тесте условие задачи можно выполнить, покрасив средний (второй) шар в синий цвет.\r\n\r\nВо втором тесте нет необходимости красить шары.\r\n"}, "scores_format": {"az": "Bu tapşırıqda hər bir düzgün testə görə bal verilir. Maksimum bal 100-dür. ", "en": "In this task, points are awarded for each correct test. The maximum score is 100.", "ru": "В этом задании баллы начисляются за каждый правильный тест. Максимальный балл $100$.\r\n"}, "source": {"az": "Azərbaycan Respublika Fənn Olimpiadası İnformatika üzrə 2022-2023 yarımfinal turu", "en": "Republican Olympiad of Azerbaijan in Informatics 2022-2023  half-finals round", "ru": "Республиканская олимпиада Азербайджана по Информатике 2022-2023 полуфинал"}, "author": {"az": "Rəşad Məmmədov", "en": "Rashad Mammadov", "ru": "Рашад Мамедов"}}