{"title": {"az": "Konfetlər", "en": "Candies", "ru": "Конфеты"}, "statement": {"az": "Fuad konfet yeməyi çox xoşlayır və onların evinin yanında böyük bir şirniyyat mağazası var. Bu mağaza yeni kampaniya elan edib. Onlar nağd ödənişlər zamanı müştərilərinə qəpik qalığını konfetlərlə qaytarırlar. Hər qəpiyə qarşılıq bir konfet. \r\n\r\nTəbii ki, verdikləri konfetlərin sayı $99$-dan çox ola bilməz, çünki $100$ qəpik $1$ manatla əvəz edilə bilər və mağaza həmişə bu prinsipə əməl edir.\r\n\r\nFuadın nənəsi ona $s$ manat nağd pul verib həmin şirniyyat mağazasından **bir** tort almasını tapşırdı. Mağazada $n$ müxtəlif tort satılır. $i$-ci tortun qiyməti $m_i$ manat $q_i$ qəpik təşkil edir. \r\n\r\nİndi Fuadın ağlında sadəcə bir şey fırlanır, o hansı tortu alsın ki, mümkün qədər çox konfet əldə etsin. Alacağı tortun bahalı və ya ucuz olması ona maraqlı deyil.\r\n\r\nFuadın əldə edə biləcəyi maksimum konfet sayını tapın. Əgər Fuadın pulu heç bir tortu almağa kifayət etmirsə, onda çıxışa $-1$ verin.", "en": "Fuad loves to eat candies, and there is a big confectionery shop near their house. This shop has announced a new promotion. When paying in cash, they give their customers candy as change. One candy for every cent.\r\n\r\nOf course, the number of candies they give cannot exceed $99$ cents, because $100$ cents can be exchanged for $1$ dollar, and the shop always follows this principle.\r\n\r\nFuad's grandmother gave him $s$ dollars in cash and told him to buy **one** cake at the confectionery. There are $n$ different cakes sold in the shop. The price of cake $i$ is $m_i$ dollars and $q_i$ cents.\r\n\r\nRight now, Fuad is only concerned about which cake to buy to get as many candies as possible. He doesn't care whether the cake he buys is expensive or cheap.\r\n\r\nFind the maximum number of candies Fuad can get. If Fuad doesn't have enough money to buy any cake, output $-1$.", "ru": "Фуад любит есть конфеты, и рядом с их домом есть большой кондитерский магазин. Этот магазин объявил новую акцию. При наличных расчетах они возвращают своим клиентам копеечную сдачу конфетами. Конфета за каждую копейку. \r\n\r\nРазумеется, количество конфет, которые они дают, не может превышать $99$ копеек, потому что монеты в $100$ копеек можно обменять на $1$ манат, и магазин всегда следует этому принципу.\r\n\r\nБабушка Фуада дала ему $s$ манатов наличными и велела купить **один** торт в кондитерской. В магазине продается $n$ разных тортов. Цена торта $i$ составляет $m_i$ манатов и $q_i$ копеек.\r\n\r\nСейчас Фуада волнует только какой торт купить, чтобы получить как можно больше конфет. Его не волнует, дорогой или дешевый торт, который он покупает.\r\n\r\nНайдите максимальное количество конфет, которое может получить Фуад. Если денег Фуада не хватает на покупку какого-либо торта, то выведите $-1$.\r\n"}, "input_format": {"az": "Birinci sətirdə bir boşluqla ayrılmış iki tam ədəd, $n$ və $s$ ($1 <= n, s <= 100$) verilir. Növbəti $n$ sətrin hər birində bir boşluqla ayrılmış iki tam ədəd, $m_i$ və $q_i$ ($1 <= m_i <= 100$, $0 <= q_i < 100$) verilir. ", "en": "The first line contains two integers, $n$ and $s$ ($1 <= n, s <= 100$), separated by a space. Each of the next $n$ lines contains two integers, $m_i$ and $q_i$ ($1 <= m_i <= 100$, $0 <= q_i < 100$), separated by a space.", "ru": "В первой строке дается два целых числа, $n$ и $s$ ($1 <= n, s <= 100$), разделенные пробелом. Каждая из следующих $n$ строк содержит два целых числа, $m_i$ и $q_i$ ($1 <= m_i <= 100$, $0 <= q_i < 100$), разделенных пробелом.\r\n"}, "output_format": {"az": "Çıxışa, Fuadın bir tort alışından əldə edə biləcəyi maksimum konfet sayını, pulu heç bir tortu almağa kifayət etmədiyi halda isə $-1$ verin.", "en": "Output the maximum number of candies that Fuad can get from buying one cake, and $-1$ if he doesn't have enough money to buy any cake.", "ru": "Выведите максимальное количество конфет, которые Фуад может получить от покупки одного торта, и $-1$, если у него недостаточно денег, чтобы купить хоть один торт."}, "notes": {"az": "#### Birinci nümünənin izahatı\r\n\r\nFuad 3-cü, yəni 30 manat 40 qəpik dəyərində olan tortu almaqla 60 qəpik qalıq qarşılığında 60 konfet əldə edə bilər.\r\n\r\n#### Ikinci nümünənin izahat\r\n\r\nFuadın pulu heç bir tortu almağa kifayət etmir.", "en": "#### Explanation of the first example\r\nFor the change of 60 cents, Fuad can get 60 candies by buying the 3rd cake priced at 30 dollars and 40 cents.\r\n\r\n#### Explanation of the second example\r\nFuad doesn't have enough money to buy any cake.", "ru": "#### Пояснение первого примера\r\nЗа сдавчу в 60 копеек Фуад может получить 60 конфет, купив 3-й торт стоимостью 30 манатов и 40 копеек.\r\n\r\n#### Пояснение второго примера\r\nДенег Фуада не хватит, чтобы купить любой торт."}, "scores_format": {"az": "Bu məsələdə hər testə görə eyni bal verilir.\r\nNümunə testlər sistem teslərinə daxil deyil.", "en": "In this task, the same points are awarded for each correct test case. Examples are not included in the system tests.", "ru": "B этом задании одинаковые баллы даются за каждый правильный тест. Примеры не входят в системные тесты."}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}