{"title": {"az": "İbrahimin Dissertasiya İşi", "en": "Ibrahim's Dissertation", "ru": "Диссертация Ибрагима"}, "statement": {"az": "İbrahim bu il universiteti bitirəcək və dissertasiya işinin xırda bir hissəsi üçün *ən uzun ortaq alt ardıcıllıq* mövsuzunu araşdırır. Araşdırma zamanı ona \r\n*permutasiyaların* ən uzun ortaq alt ardıcıllığını tapmaq lazım gəldi. Onun isə permutasiyalar ilə heç arası yoxdur. Ona görə də bu işdə ona kömək edin.\r\n\r\nSizə $1,2,...,n$ ədədlərinin hər hansı yerdəyişmələrindən ibarət $k$ sayda permutasiya verilir. Verilmiş permutasiyaların ən uzun ortaq alt ardıcıllığının uzunluğunu tapın.\r\n\r\n**Qeyd 1:** $1,2,...,n$ ədədlərinin hər hansı yerdəyişməsinə $n$ elementdən ibarət permutasiya deyilir.\r\n\r\n**Qeyd 2:** Ardıcıllığın alt ardıcıllığı, qalan elementlərin sırasını dəyişdirmədən bəzi elementləri silməklə və ya heç bir elementi silmədən verilmiş ardıcıllıqdan əldə edilə bilən ardıcıllıqdır. İki və ya daha çox ardıcıllıqda rast gəlinən alt ardıcıllığa bu ardıcıllıqların ortaq alt ardıcıllığı deyilir. \r\n", "en": "Ibrahim is finishing his studies this year and is researching *the* *longest* *common* *subsequence* for a small part of his dissertation. In his research, he needed to find the longest common subsequence of *permutations*. Ibrahim is not good at permutations. So help him with this.\r\n\r\nYou are given $k$ number of permutations, consisting of any permutations of numbers $1,2,...,n$. Find the length of the longest common subsequence of these permutations.\r\n\r\n**Note 1:** Any permutation of numbers $1,2,...,n$ is called a permutation consisting of $n$ elements.\r\n\r\n**Note 2:** A subsequence of a sequence is a sequence that can be derived from the given sequence by deleting some elements without changing the order of the remaining elements, or by not deleting any elements. A subsequence that is common to two or more sequences is called a common subsequence of those sequences.", "ru": "Ибрагим заканчивает учебу в этом году и исследует *самую*  *длинную* *общую* *подпоследовательность* для небольшой части своей диссертации. В своем исследовании ему нужно было найти самую длинную общую подпоследовательность *пермутаций*. Ибрагим не хорош в пермутациях. Так помогите ему в этом. \r\n\r\nВам дано $k$ количество пермутаций, состоящие из любых перестановок чисел $1,2,...,n$. Найдите длину самой длинной общей подпоследовательности данных пермутаций.\r\n\r\n**Примечание 1:** Любая перестановка чисел $1,2,...,n$ называется пермутацией, состоящей из $n$ элементов.\r\n\r\n**Примечание 2:** Подпоследовательность последовательности — это последовательность, которую можно получить из заданной последовательности удалением некоторых элементов без изменения порядка остальных элементов или не удаляя ни один из элементов. Подпоследовательность, входящая в две или более последовательностей, называется общей подпоследовательностью этих последовательностей. "}, "input_format": {"az": "Birinci sətirdə bir boşluqla ayrılmış iki tam ədəd, $n$ və $k$ ($1 <= n <= 1000$, $2 <= k <= 5$) verilir. Növbəti $k$ sətrin hər birində boşluqla ayrılmış $n$ sayda tam ədəd, $1,2,...,n$ ədədlərinin hər hansı yerdəyişmələrindən ibarət permutasiya verilir. ", "en": "The first line contains two integers, $n$ and $k$ ($1 <= n <= 1000$, $2 <= k <= 5$), separated by a space. Each of the next $k$ lines contains a permutation consisting of any permutations of $n$ integers $1,2,...,n$, separated by spaces.", "ru": "В первой строке даны два целых числа, $n$ и $k$ ($1 <= n <= 1000$, $2 <= k <= 5$), разделенные пробелом. В каждой из следующих $k$ строк задана пермутация, состоящая из любых перестановок $n$ целых чисел $1,2,...,n$, разделенных пробелами."}, "output_format": {"az": "Çıxışa, verilmiş permutasiyaların ən uzun ortaq alt ardıcıllığının uzunluğunu verin.", "en": "Output the length of the longest common subsequence of the given permutations.", "ru": "Выведите длину самой длинной общей подпоследовательности данных пермутаций.\r\n"}, "notes": {"az": "#### İlk nümünənin izahatı:\r\n\r\nBu nümunədə \"2 3 5\" və ya \"2 4 5\" ardıcılıqları ikisi də ən uzun ortaq alt ardıcıllıqdır. Yəni onların ikisinə də hər iki permutasiyada rast gəlinir.\r\n\r\n\r\n#### Ikinci nümünənin izahatı:\r\nBu nümunədə \"1 2 3\" ən uzun ortaq alt ardıcıllıqdır. Yəni ona hər üç permutasiyada rast gəlinir.\r\n\r\n\r\n", "en": "#### Explanation of the First Example\r\nIn this example, the sequences \"2 3 5\" or \"2 4 5\" are the longest common subsequences. That is, they both appear in both permutations.\r\n\r\n#### Explanation of the Second Example\r\nIn this example, \"1 2 3\" is the longest common subsequence. That is, it appears in all three permutations.", "ru": "#### Пояснение первого примера\r\nВ этом примере последовательности \"2 3 5\" или \"2 4 5\" являются самыми длинными общими подпоследовательностями. То есть они оба  встречаются в обеих пермутациях.\r\n\r\n#### Пояснение второго примера\r\nВ этом примере \"1 2 3\" — самая длинная общая подпоследовательность. То есть она встречается во всех трёх пермутациях."}, "scores_format": {"az": "Bu məsələ aşağıdakı kimi $3$ alt tapşırıqdan ibarətdir:\r\n\r\n| Alt tapşırıq |  Əlavə məhdudiyyətlər | Qiymətləndirmə |\r\n|-----------------|------------------------------------------|----------------|\r\n| 1               |  $k=2$  |   17 bal    |\r\n| 2               | $n^k<=10^6$  |   17 bal    |\r\n| 3               | Əlavə məhdudiyyət yoxdur |   66 bal   |\r\n", "en": "This problem consists of the following $3$ subtasks:\r\n\r\n| Subtask | Additional Constraints | Score |\r\n|---------|------------------------|-------|\r\n| 1       | $k=2$                  | 17 points |\r\n| 2       | $n^k<=10^6$            | 17 points |\r\n| 3       | No additional constraints | 66 points |", "ru": "Данная задача состоит из нижеследующих $3$-х подзадач\r\n\r\n| Подзадача |  Дополнительные ограничения | Оценивание  |\r\n|-----------------|------------------------------------------|----------------|\r\n| 1               |  $k=2$  |   17 баллов    |\r\n| 2               | $n^k<=10^6$  |   17 баллов    |\r\n| 3               | Дополнительных ограничений нет|   66 баллов   |\r\n"}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}