{"title": {"az": "Sahə", "en": "Square", "ru": "Площадь"}, "statement": {"az": "Vasyanın məmləkətindəki ərazi **n** × **m** metrlik düzbucaqlıdır. Şəhərin yubileyi münasibətilə meydanın kvadrat qranit plitələrlə döşənməsi qərara alınıb. Hər plitənin ölçüsü **k** × **k** metrdir. Yubiley çox yaxındır, lakin işçilər meydanın döşənməsi üçün ən az sayda plitə lazım olacağını müəyyən edə bilmədilər. Vasya dərhal bu problemin həllini tapdı. Siz onu icad edə bilərsinizmi?\r\n\r\nSahədən daha böyük bir səthi plitələrlə örtməyə icazə verilir, lakin ərazinin özü örtülməlidir. Qranit plitələri qırmaq və ya əzmək olmaz, yalnız bütövlükdə istifadə etməyə icazə verilir. Plitələrin sərhədləri ərazinin sərhədlərinə paralel olmalıdır.\r\n", "en": "The square in Vasya's hometown is a rectangle of **n** × **m** meters. On the occasion of the city's anniversary, it was decided to pave the square with granite slabs. Each plate has a size of **k** × **k** meters. The anniversary is very close, but the workers were still unable to determine what is the least number of slabs would be needed to pave the square. Vasya immediately came up with a solution for this task. And can you think of it?\r\n\r\nIt is allowed to cover with plates the surface larger than the area of a square, but the area itself must be totally covered. Granite slabs can not be broken or crushed, they can only be used as a whole. The boundaries of the plates should be parallel to the boundaries of the area.\r\n", "ru": "Площадь в родном городе Васи представляет собой прямоугольник **n** × **m** метров. По случаю юбилея города было принято решение о замощении площади квадратными гранитными плитами. Каждая плита имеет размер **k** × **k** метров. Юбилей совсем близко, но рабочие так и не смогли определить, какое наименьшее количество плит понадобится для замощения площади. Вася моментально придумал решение для этой задачи. А сможете ли придумать его Вы?\r\n\r\nРазрешено покрыть плитами поверхность бóльшую, чем площадь, но сама площадь должна быть покрыта обязательно. Гранитные плиты нельзя ломать или дробить, их разрешено использовать только целиком. Границы плит должны быть параллельны границам площади.\r\n"}, "input_format": {"az": "Üç tam ədəd **n**, **m**, **k** (**1** ≤ **n**, **m**, **k** ≤ **1000** ) .\r\n", "en": "Three integers **n**, **m**, **k** (**1** ≤ **n**, **m**, **k** ≤ **1000**).\r\n", "ru": "Три целых числа **n**, **m**, **k** (**1** ≤ **n**, **m**, **k** ≤ **1000**).\r\n"}, "output_format": {"az": "Təsvir edilən tələblərə uyğun olaraq ərazini asfaltlamaq üçün lazım olan minimum plitələrin sayını çıxarın.", "en": "Print the minimum number of slabs that will be required to pave the area in accordance with the requirements described.", "ru": "Выведите минимальное количество плит, которое потребуется для замощения площади в соответствии с описанными требованиями."}, "notes": {"az": "", "en": "", "ru": ""}, "scores_format": {"az": "", "en": "", "ru": ""}, "source": {"az": "", "en": "", "ru": ""}, "author": {"az": "", "en": "", "ru": ""}}